RT-Thread/rt-thread/bsp/mm32f103/Libraries/MM32x103/Include/MM32x103.h
/******************  Bit definition for DBGMCU_CR register  *******************/
#define  DBGMCU_CR_DBG_SLEEP                 ((uint32_t)0x00000001)        /*!<Debug Sleep Mode */
#define  DBGMCU_CR_DBG_STOP                  ((uint32_t)0x00000002)        /*!<Debug Stop Mode */
#define  DBGMCU_CR_DBG_STANDBY               ((uint32_t)0x00000004)        /*!<Debug Standby mode */

#define  DBGMCU_CR_DBG_IWDG_STOP             ((uint32_t)0x00000100)        /*!<Debug Independent Watchdog stopped when Core is halted */
#define  DBGMCU_CR_DBG_WWDG_STOP             ((uint32_t)0x00000200)        /*!<Debug Window Watchdog stopped when Core is halted */
#define  DBGMCU_CR_DBG_TIM1_STOP             ((uint32_t)0x00000400)        /*!<TIM1 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM2_STOP             ((uint32_t)0x00000800)        /*!<TIM2 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM3_STOP             ((uint32_t)0x00001000)        /*!<TIM3 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM4_STOP             ((uint32_t)0x00002000)        /*!<TIM4 counter stopped when core is halted */


/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                   ((uint8_t)0x07)               /*!<LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 ((uint8_t)0x01)               /*!<Bit 0 */
#define  FLASH_ACR_LATENCY_1                 ((uint8_t)0x02)               /*!<Bit 0 */
#define  FLASH_ACR_LATENCY_2                 ((uint8_t)0x04)               /*!<Bit 1 */

#define  FLASH_ACR_HLFCYA                    ((uint8_t)0x08)               /*!<Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                    ((uint8_t)0x10)               /*!<Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    ((uint8_t)0x20)               /*!<Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                    ((uint32_t)0xFFFFFFFF)        /*!<FPEC Key */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define  FLASH_OPTKEYR_OPTKEYR               ((uint32_t)0xFFFFFFFF)        /*!<Option Byte Key */

/******************  Bit definition for FLASH_SR register  *******************/
#define  FLASH_SR_BSY                        ((uint8_t)0x01)               /*!<Busy */
#define  FLASH_SR_PGERR                      ((uint8_t)0x04)               /*!<Programming Error */
#define  FLASH_SR_WRPRTERR                   ((uint8_t)0x10)               /*!<Write Protection Error */
#define  FLASH_SR_EOP                        ((uint8_t)0x20)               /*!<End of operation */

/*******************  Bit definition for FLASH_CR register  *******************/
#define  FLASH_CR_PG                         ((uint16_t)0x0001)            /*!<Programming */
#define  FLASH_CR_PER                        ((uint16_t)0x0002)            /*!<Page Erase */
#define  FLASH_CR_MER                        ((uint16_t)0x0004)            /*!<Mass Erase */
#define  FLASH_CR_OPTPG                      ((uint16_t)0x0010)            /*!<Option Byte Programming */
#define  FLASH_CR_OPTER                      ((uint16_t)0x0020)            /*!<Option Byte Erase */
#define  FLASH_CR_STRT                       ((uint16_t)0x0040)            /*!<Start */
#define  FLASH_CR_LOCK                       ((uint16_t)0x0080)            /*!<Lock */
#define  FLASH_CR_OPTWRE                     ((uint16_t)0x0200)            /*!<Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      ((uint16_t)0x0400)            /*!<Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      ((uint16_t)0x1000)            /*!<End of operation interrupt enable */

/*******************  Bit definition for FLASH_AR register  *******************/
#define  FLASH_AR_FAR                        ((uint32_t)0xFFFFFFFF)        /*!<Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define  FLASH_OBR_OPTERR                    ((uint16_t)0x0001)            /*!<Option Byte Error */
#define  FLASH_OBR_RDPRT                     ((uint16_t)0x0002)            /*!<Read protection */

#define  FLASH_OBR_USER                      ((uint16_t)0x03FC)            /*!<User Option Bytes */
#define  FLASH_OBR_WDG_SW                    ((uint16_t)0x0004)            /*!<WDG_SW */
#define  FLASH_OBR_nRST_STOP                 ((uint16_t)0x0008)            /*!<nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                ((uint16_t)0x0010)            /*!<nRST_STDBY */
//#define  FLASH_OBR_Notused                   ((uint16_t)0x03E0)            /*!<Not used */           //by   chenhui

/******************  Bit definition for FLASH_WRPR register  ******************/
#define  FLASH_WRPR_WRP                        ((uint32_t)0xFFFFFFFF)        /*!<Write Protect */

/*----------------------------------------------------------------------------*/

/******************************************************************************/
/*                                                                            */
/*                                   CAN Registers and bits                   */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CAN_CMR register  *******************/
#define  CAN_CMR_TR                          ((uint16_t)0x0001)     
#define  CAN_CMR_AT                          ((uint16_t)0x0002)   
#define  CAN_CMR_RRB                         ((uint16_t)0x0004)   
#define  CAN_CMR_CDO                         ((uint16_t)0x0008)   
#define  CAN_CMR_GTS                         ((uint16_t)0x0010) 

/*******************  Bit definition for CAN_SR register  *******************/
#define  CAN_SR_RBS                          ((uint16_t)0x0001)     
#define  CAN_SR_DOS                          ((uint16_t)0x0002)   
#define  CAN_SR_TBS                          ((uint16_t)0x0004)   
#define  CAN_SR_TCS                          ((uint16_t)0x0008)   
#define  CAN_SR_RS                           ((uint16_t)0x0010) 
#define  CAN_SR_TS                           ((uint16_t)0x0020) 
#define  CAN_SR_ES                           ((uint16_t)0x0040) 
#define  CAN_SR_BS                           ((uint16_t)0x0080) 

/*******************  Bit definition for CAN_IR register  *******************/
#define  CAN_IR_RI                           ((uint16_t)0x0001)     
#define  CAN_IR_TI                           ((uint16_t)0x0002)   
#define  CAN_IR_EI                           ((uint16_t)0x0004)   
#define  CAN_IR_DOI                          ((uint16_t)0x0008)   
#define  CAN_IR_WUI                          ((uint16_t)0x0010) 
#define  CAN_IR_EPI                          ((uint16_t)0x0020) /*PeliCAN*/
#define  CAN_IR_ALI                          ((uint16_t)0x0040) /*PeliCAN*/
#define  CAN_IR_BEI                          ((uint16_t)0x0080) /*PeliCAN*/

/*******************  Bit definition for CAN_BTR0 register  *******************/
#define  CAN_BTR0_BRP                        ((uint16_t)0x003F)     
#define  CAN_BTR0_BRP_0                      ((uint16_t)0x0001)   
#define  CAN_BTR0_BRP_1                      ((uint16_t)0x0002) 
#define  CAN_BTR0_BRP_2                      ((uint16_t)0x0004)  
#define  CAN_BTR0_BRP_3                      ((uint16_t)0x0008) 
#define  CAN_BTR0_BRP_4                      ((uint16_t)0x0010)  
#define  CAN_BTR0_BRP_5                      ((uint16_t)0x0020)  

#define  CAN_BTR0_SJW                        ((uint16_t)0x00C0)   
#define  CAN_BTR0_SJW_0                      ((uint16_t)0x0040)
#define  CAN_BTR0_SJW_1                      ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BTR1 register  *******************/
#define  CAN_BTR1_SAM                        ((uint16_t)0x0080) 

#define  CAN_BTR1_TSEG1                      ((uint16_t)0x000F)     
#define  CAN_BTR1_TSEG1_0                    ((uint16_t)0x0001)   
#define  CAN_BTR1_TSEG1_1                    ((uint16_t)0x0002) 
#define  CAN_BTR1_TSEG1_2                    ((uint16_t)0x0004)  
#define  CAN_BTR1_TSEG1_3                    ((uint16_t)0x0008)

#define  CAN_BTR1_TSEG2                      ((uint16_t)0x0070)     
#define  CAN_BTR1_TSEG2_0                    ((uint16_t)0x0010)   
#define  CAN_BTR1_TSEG2_1                    ((uint16_t)0x0020) 
#define  CAN_BTR1_TSEG2_2                    ((uint16_t)0x0040)

/*******************  Bit definition for CAN_CDR register  *******************/
#define  CAN_CDR_MODE                        ((uint16_t)0x0080) 

/*!<BasicCAN registers */
/*******************  Bit definition for CAN_CR register  *******************/
#define  CAN_CR_RR                           ((uint16_t)0x0001) 
#define  CAN_CR_RIE                          ((uint16_t)0x0002) 
#define  CAN_CR_TIE                          ((uint16_t)0x0004) 
#define  CAN_CR_EIE                          ((uint16_t)0x0008) 
#define  CAN_CR_OIE                          ((uint16_t)0x0010) 

/*******************  Bit definition for CAN_ACR register  *******************/
#define  CAN_ACR_AC                          ((uint16_t)0x00FF)     
#define  CAN_ACR_AC_0                        ((uint16_t)0x0001)   
#define  CAN_ACR_AC_1                        ((uint16_t)0x0002) 
#define  CAN_ACR_AC_2                        ((uint16_t)0x0004)  
#define  CAN_ACR_AC_3                        ((uint16_t)0x0008)  
#define  CAN_ACR_AC_4                        ((uint16_t)0x0010)  
#define  CAN_ACR_AC_5                        ((uint16_t)0x0020)  
#define  CAN_ACR_AC_6                        ((uint16_t)0x0040) 
#define  CAN_ACR_AC_7                        ((uint16_t)0x0080)    

